cpp/icoFoamOCL/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    movingWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2000;
        startFace       7996000;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       7998000;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          8000000;
        startFace       8004000;
    }
)

// ************************************************************************* //
